water-hammer/case-3d/fluid3d-openfoam-uncoupled/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}

convertToMeters 1;

vertices
 (
     ( -0.5  0  -0.5 )  //0
     ( 0.5  0  -0.5 )   //1
     ( 0.5 1000 -0.5 )   //2
     ( -0.5 1000 -0.5 )  //3
     ( -0.5  0  0.5 )  //4
     ( 0.5  0  0.5 )    //5
     ( 0.5 1000 0.5 )   //6
     ( -0.5 1000 0.5 )  //7
 );

 blocks
(
     hex (0 1 2 3 4 5 6 7) (10 200 10) simpleGrading (1 1 1)  //1
);


  edges
  (
  );

boundary
(
    outlet
     {
         type patch;
             faces
             (
             (3 7 6 2)
             );
     }

    inlet
     {
        type patch;
             faces
             (
             (0 1 5 4)
             );
    }

     xEmpty1
     {
     //   type empty;
        //type wall;
        type symmetryPlane;

             faces
             (
             (4 7 3 0)
             );
     }

     xEmpty2
     {
      //        type empty;
        //type wall;
        type symmetryPlane;

             faces
             (
             (1 2 6 5)
             );
     }
     yEmpty1
     {
        //  type empty;
        //type wall;
        type symmetryPlane;
             faces
             (
             (0 3 2 1)
             );
     }

     yEmpty2
     {
     // type empty;
        //type wall;
        type symmetryPlane;
             faces
             (
             (5 6 7 4)
             );
     }

);

 mergePatchPairs
 (
 );

 // ************************************************************************* //



