water-hammer/case-3d/fluid3d-openfoam-uncoupled/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 98100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 98100;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 98100;
    }

    xEmpty1
    {
       // type            zeroGradient;
       // type            empty;
        type           symmetryPlane;
    }

    xEmpty2
    {
      // type            zeroGradient;
      // type            empty;
          type           symmetryPlane;
    }

    yEmpty1
    {
         //type            zeroGradient;
      // type            empty;
           type           symmetryPlane;
    }


    yEmpty2
    {
         // type            zeroGradient;
       //  type            empty;
         type           symmetryPlane;
    }

}

// ************************************************************************* //
