water-hammer/case-3d/fluid3d-openfoam-uncoupled/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          PBiCG;
        preconditioner  DILU
        //smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    "U.*"
    {
        $p;
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.1;
    }
}

PIMPLE
{
    nOuterCorrectors 4;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
